ЦентраАдминистрированияСервер/src/DataProcessors/ЗагрузкаИнформационныхБаз/ЗагрузкаИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИнформационныхБаз</name>
</mdclass:DataProcessor>

ЦентраАдминистрированияСервер/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>Архивная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыВКластере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.Кластеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКБазе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗапуска</name>
    <type>
      <types>EnumRef.РежимЗапускаПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверБазДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСервернаяИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/DataProcessors/ЗагрузкаИнформационныхБаз/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СерверПриложения1СПриИзменении(Элемент)
	СерверПриложения1СПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СерверПриложения1СПриИзмененииНаСервере()
	БазыКластераТаблица = РаботаСПодключениямиCOM.ПолучитьБазыКластера(ЭтаФорма.Кластер);
	
	СписокИнформационныхБаз.Очистить();
	Для Каждого БазаКластера Из БазыКластераТаблица Цикл
		НоваяСтрока = СписокИнформационныхБаз.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,БазаКластера);
	КонецЦикла;
	
	СписокИнформационныхБаз.Сортировать("Name");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаИстина(Команда)
	Для каждого СтрокаТаблицы из СписокИнформационныхБаз цикл
		СтрокаТаблицы.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаЛожь(Команда)
	Для каждого СтрокаТаблицы из СписокИнформационныхБаз цикл
		СтрокаТаблицы.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранные(Команда)
	ЗагрузитьВыбранныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВыбранныеНаСервере()
	
	Для каждого СтрокаТаблицы из СписокИнформационныхБаз цикл
		Если СтрокаТаблицы.Отметка = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяБаза = Справочники.ИнформационныеБазы.НайтиПоРеквизиту("ИмяБазыВКластере", СтрокаТаблицы.Name);
		Если  НайденнаяБаза = Справочники.ИнформационныеБазы.ПустаяСсылка() Тогда
			ИнформационнаяБазаОбъект = Справочники.ИнформационныеБазы.СоздатьЭлемент();
		Иначе
			ИнформационнаяБазаОбъект = НайденнаяБаза.ПолучитьОбъект();
		КонецЕсли;
		
		ИнформационнаяБазаОбъект.Кластер = Кластер;
		ИнформационнаяБазаОбъект.ИмяБазыВКластере = СтрокаТаблицы.Name;
		ИнформационнаяБазаОбъект.Наименование = СтрокаТаблицы.Descr;
		ИнформационнаяБазаОбъект.Записать();
		
		СтрокаТаблицы.Ссылка = ИнформационнаяБазаОбъект.Ссылка;
	КонецЦикла;
	
КонецПроцедуры
